# Explore Social Security Name Data

## Set up environment

In [18]:
# import packages
import pandas as pd
import matplotlib.pyplot as plt
import os
import numpy as np 
import freqit
import re
from pandas_profiling import ProfileReport

# set working directory
os.chdir("/Users/Lauren/Documents/Python/ChicagoData")
# os.getcwd()
# os.listdir('.')

# color palette
# source: https://learnui.design/tools/data-color-picker.html#palette
pdblue = '#003f5c'
plblue = '#444e86'
ppurple = '#955196'
ppink = '#dd5182'
porange = '#ff6e54'
pyellow = '#ffa600'
pgray = '#64666B'

In [7]:
# set file paths
datapath = r"/Users/Lauren/Documents/Python/data/ssa_names_natl"

## Get Data

The ssa datasets are in csv text files, one file per year. Also in the data folder is a pdf readme about the datafiles. We want to read in the data and skip over the readme.

In [24]:
# get list of files in data folder
os.chdir(datapath)
files = os.listdir('.')
len(files)

141

In [27]:
# keep files of format yob+year+.txt
pattern = 'yob[0-9]{4}.txt'
files = [i for i in files if re.search(pattern, i)]
len(files)

140

In [35]:
namedf = pd.DataFrame()
colnames = ['name','gender','count']
for f in files:
    df = pd.read_csv(datapath+'/'+f
                    ,names=colnames)
    df['year'] = re.search('[0-9]{4}', f).group(0)
    namedf = namedf.append(df)

namedf.year.value_counts()

2008    35084
2007    34962
2009    34715
2006    34094
2010    34082
        ...
1885     2294
1882     2127
1883     2084
1880     2000
1881     1935
Name: year, Length: 140, dtype: int64

In [36]:
namedf.head(25)

         name gender  count  year
0       Emily      F  25957  2000
1      Hannah      F  23083  2000
2     Madison      F  19968  2000
3      Ashley      F  17997  2000
4       Sarah      F  17705  2000
5      Alexis      F  17630  2000
6    Samantha      F  17265  2000
7     Jessica      F  15709  2000
8   Elizabeth      F  15105  2000
9      Taylor      F  15078  2000
10     Lauren      F  14175  2000
11     Alyssa      F  13553  2000
12      Kayla      F  13312  2000
13    Abigail      F  13090  2000
14    Brianna      F  12880  2000
15     Olivia      F  12852  2000
16       Emma      F  12555  2000
17      Megan      F  11434  2000
18      Grace      F  11285  2000
19   Victoria      F  10926  2000
20     Rachel      F  10679  2000
21       Anna      F  10593  2000
22     Sydney      F  10242  2000
23    Destiny      F   9850  2000
24     Morgan      F   9502  2000

In [37]:
namedf.tail(25)

          name gender  count  year
31929      Zeo      M      5  2019
31930   Zeplyn      M      5  2019
31931  Zerrick      M      5  2019
31932   Zeshan      M      5  2019
31933     Zeyn      M      5  2019
31934      Zhi      M      5  2019
31935   Ziayre      M      5  2019
31936   Zichen      M      5  2019
31937   Ziheng      M      5  2019
31938      Zio      M      5  2019
31939   Ziquan      M      5  2019
31940     Zire      M      5  2019
31941     Zkai      M      5  2019
31942    Zolin      M      5  2019
31943    Zoser      M      5  2019
31944   Zurain      M      5  2019
31945     Zyah      M      5  2019
31946    Zyare      M      5  2019
31947  Zygmunt      M      5  2019
31948  Zyhaire      M      5  2019
31949   Zyheem      M      5  2019
31950    Zykel      M      5  2019
31951   Zyking      M      5  2019
31952      Zyn      M      5  2019
31953    Zyran      M      5  2019